#### 001 УВОЗ EXCEL ФАЈЛА У JUPYTER РАДНУ СВЕСКУ
Учитајте радни лист 8-1 из Excel-овог фајла Učenici.xlsx. Прикажите табелу у радном листу.

In [2]:
import pandas as pd
ucenici81 = pd.read_excel("podaci/Učenici.xlsx", sheet_name="8-1")
ucenici81

       Ime  Biologija  Geografija  Istorija  Fizika  Hemija
0    Bojan         17          20        20      20      19
1  Mirjana         15          15        17      18      14
2   Marina         12          16        18      10      16
3   Branko         19          20        19      19      20
4    Miloš         14          12        11      17      17
5    Petar         12          19        15      14      14
6    Nenad         10          12        12      17      15
7    Dejan         16          20        17      17      17

#### 002 УВОЗ ОДРЕЂЕНИХ КОЛОНА EXCEL ФАЈЛА У JUPYTER РАДНУ СВЕСКУ 
Учитајте радни лист 8-2 из Excel-овог фајла Učenici.xlsx. Прикажите само колоне Име и Историја из дате табеле.

In [3]:
import pandas as pd
ucenici82 = pd.read_excel("podaci/Učenici.xlsx", sheet_name="8-2")
ucenici82[['Ime','Istorija']]

       Ime  Istorija
0    Dana         20
1    Srđan        17
2  Nemanja        18
3   Milica        19
4     Lena        15
5    Đorđe        15
6    Vanja        12
7    Zoran        17

#### 003 УВОЗ ОДРЕЂЕНИХ КОЛОНА И РЕДОВА EXCEL ФАЈЛА У JUPYTER РАДНУ СВЕСКУ 
Учитајте радни лист 8-3 из Excel-овог фајла Učenici.xlsx. Сортирајте нерастуће табелу. Прикажите првих шест редова колона Име и Биологија из сортиране табеле.

In [4]:
import pandas as pd
ucenici83 = pd.read_excel("podaci/Učenici.xlsx", sheet_name="8-3")
sortirano=ucenici83.sort_values(by="Biologija", ascending=False)
ucenici83[['Ime','Biologija']].head(6)

          Ime  Biologija
0     Miodrag         15
1        Ines         15
2         Una         15
3      Nikola         16
4       Đorđe         18
5  Anastasija         20

#### 004 ФРЕКВЕНЦИЈСКА АНАЛИЗА ПОДАТАКА
Из претходно креиране табеле ученика 8-3 (ucenici83) помоћу методе value_counts() прикажите расподелу поена из Физике.

In [5]:
ucenici83['Fizika'].value_counts()

18    3
17    2
19    2
20    1
Name: Fizika, dtype: int64

#### 005 ФИЛТРИРАЊЕ ПОДАТАКА У JUPYTER РАДНОЈ СВЕСЦИ
Из претходно креиране табеле ученика 8-3 (ucenici83) прикажите само оне ученике који имају већи број бодова од 14 из предмета Биологија и већи број бодова од 17 из предмета Хемија.

In [6]:
viseod17=ucenici83[(ucenici83.Biologija>14)&(ucenici83.Hemija>17)]
viseod17

       Ime  Biologija  Geografija  Istorija  Fizika  Hemija
0  Miodrag         15          17        12      20      19
1     Ines         15          19        16      18      20
2      Una         15          16        14      19      20
4    Đorđe         18          18        19      18      20